{
  "hi": "سلام {{name}}",
  "home": "",
  "users": "کاربران",
  "addUser": "افزودن کاربر",
  "fullName": "نام و نام خانوادگی",
  "inputPlaceHolder": "{{fieldName}} را وارد کنید...",
  "mobile": "موبایل",
  "submit": "ثبت",
  "firstName": "نام",
  "lastName": "نام خانوادگی",
  "searchBy": "جست و جو بر اساس {{fieldName}}",
  "yes": "بله",
  "no": "خیر",
  "version": "ورژن {{version}}",
  "usersList": "لیست کاربران",
  "guest": "مهمان",
  "projectTitle": "پروژه چالش برنامه نویسی فرانت شرکت موترک",
  "projectDetail": "نمایش اطلاعات کاربران از api مشخص شده. امکان مشاهده لیست کاربران، حذف کاربر و مورد علاقه کردن کاربر.",
  "projectTools": "ابزارهای استفاده شده در پروژه",
  "projectDescription1": "برای توسعه پروژه از فریموورک nextjs استفاده شده است. این فریموورک یکی از معروفترین فریموورک های ری اکت برای داشتن رفتار SSR در ری اکت است.",
  "projectDescription2": "وظیفه ارسال و دریافت اطلاعات از سرور به عهده ریداکس گذاشته شده است. برای این کار از کتابخانه RTK query استفاده شده است. مهترین ویژگی این روش داشتن سیستم cache بسیار قوی در مقایسه با کتابخانه های رقیب می باشد. سادگی سینتکس و اضافه نشدن provider جدید به پروژه از دیگر ویژگی های این کتابخانه می باشد.",
  "projectDescription3": "برای نمایش کلمات از کتابخانه i18next استفاده شده است. این کتابخانه علاوه بر اینکه امکان چند زبانه کردن پروژه را به توسعه دهنده می دهد، در بسیاری موارد جلوی تکرار کلمات و عبارات را در پروژه را میگیرد.",
  "projectDescription4": "برای استایل دهی از فریموورک tailwind css استفاده شده است.",
  "projectDescription5": "در طراحی کامپوننت ها در حد امکان واکنش پذیر بودن سایت (Responsive) و امکان استفاده مجدد از کامپوننت ها (Reusable Components) لحاظ شده است.",
  "projectDescription6": "برای نمایش فرم صفحه افزودن کاربر جدید، از کتابخانه formik استفاده شده است. برای اعتبارسنجی فرم نیز از کتابخانه yup استفاده شده است.",
  "projectDescription7": "داشتن سایدبار متحرک موجب داشتن فضای بیشتر خصوصا در نمایش موبایل سایت می شود. (در پروژه برای داشتن فضای بیشتر،به جای سایدبار ثابت، سایدبار متحرک طراحی شده است)",
  "projectWarning": "لطفا قبل از بالا آمدن پروژه، پروژه بکند را روی پورت 3009 بالا بیاورید. ضمنا در api دریافت لیست کاربران، مقدار فیلد total اشتباه نمایش داده میشد. مقدار صحیح فیلد total که باید برگردد عدد 300 است.",
  "poweredBy": "توسعه داده شده توسط رضا قهرمانی، تیر 1401"
}
